//JOB004 JOB
//S010 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=SAMPLE.FEES,DISP=SHR
//SYSUT2 DD DSN=SAMPLE.AUDIT,DISP=(NEW,CATLG,DELETE)
//SYSIN DD DUMMY
//S020 EXEC PGM=LOADDB
//FEES DD DSN=SAMPLE.FEES,DISP=SHR
