//JOB002 JOB
//S010 EXEC PGM=SORT
//SORTIN DD DSN=SAMPLE.ACCEPT,DISP=SHR
//SORTOUT DD DSN=SAMPLE.SORTED,DISP=(NEW,CATLG,DELETE)
//SYSIN DD *
 SORT FIELDS=(1,6,CH,A)
 OPTION EQUALS
/*
