//JOB001 JOB
//S010 EXEC PGM=CLASSIFY
//RAWIN DD DSN=SAMPLE.RAW,DISP=SHR
//BDATE DD DSN=SAMPLE.BDATE,DISP=SHR
//ACCEPT DD DSN=SAMPLE.ACCEPT,DISP=(NEW,CATLG,DELETE)
//REJECT DD DSN=SAMPLE.REJECT,DISP=(NEW,CATLG,DELETE)
